/*    Copyright 2017 	АО "НИИЭТ" и ООО "НПФ ВЕКТОР"

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

       http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
*/
// V_motorParams_IM.h
//Файл с массивами параметров модели для различных вариантов АД

//структура с параметрами двигателя
struct SIm_param
{
	 float l_s; 		//!< индуктивность статора АД, мГн
	 float l_r; 		//!<индуктивность ротора АД, мГн
	 float l_m; 		//!< взаимная индуктивность АД, мГн
	 float r_s; 		//!< сопротивления статора АД, Ом
	 float r_r; 		//!< сопротивления ротора АД, Ом
	 float pp; 			//!< число пар полюсов
	 float j;			//!< момент инерции
	 float qep; 		//!< число меток энкодера
	 float RatedPower;	//!< номинальная мощность (справочная величина, не используется в расчетах)
	 float RatedSpeed;	//!< номинальная скорость (справочная величина, не используется в расчетах)
	 float RatedCurrent;//!< номинальный действующий ток
};
typedef volatile struct SIm_param TIm_param;

// !!! Внимание! Последний набор параметров в массиве ОБЯЗАТЕЛЬНО должен быть нулевым!
TIm_param IMDATA[] = {\
//		|l_s		   |l_r			   |l_m			   |r_s			   |r_r			   |pp |j		   |qep	  |Power	|Speed	|Current
		{1061.178953,	1207.845962,	862.747116,		0.323530168,	0.30196149,		1,	0.000025,	10000,	0.09,	2742,	0.33},\
		{120.0077682,	134.7046485,	100.525857,		0.02460873,		0.016064032,	1,	0.0035,		10000,	3,		2871,	3.6},\
		{57.87703671,	64.10285341,	46.117161,		0.006640871,	0.004565599,	2,	0.028,		7500,	7.5,	1456.5,	9},\
		{24.52581085,	27.82032276,	18.302844,		0.003440935,	0.001830284,	2,	0.1,		7500,	15,		1465.5,	16.5},\
		{17.96736825,	19.49044633,	12.382749,		0.002538463,	0.001218462,	3,	0.4,		7500,	22,		977,	25},\
		{11.17601802,	12.08152021,	8.157677,		0.001267703,	0.000573485,	3,	0.74,		7500,	37,		982,	40},\
		{11.327834,		12.990883,		9.008934,		0.000866659,	0.000374772,	4,	0.4,		5000,	45,		732.75,	52},\
		{10.07503,		10.462531,		7.750023,		0.000678127,	0.000426251,	4,	3.2,		5000,	55,		733.5,	62.5},\
		{7.639308,		8.18058,		6.150812,		0.000392422,	0.000365358,	5,	6.2,		5000,	75,		590.4,	89.5},\
		{7.129873,		7.665506,		5.95148,		0.000257104,	0.000214253,	6,	10,			5000,	90,		493.5,	113},\
		{0,				0,				0,				0,				0,				0,	0,			0,		0,		0,		0},\
};
